{
    "class_name": "Functional",
    "name": "model_2",
    "layers": [
        {
            "class_name": "InputLayer",
            "name": "input_3",
            "shape": [
                [
                    10,
                    128
                ]
            ],
            "neurons": 1280,
            "additions": 0,
            "multiplications": 0,
            "comparasions": 0,
            "connections": 0
        },
        {
            "class_name": "Conv1D",
            "name": "conv1d_4",
            "shape": [
                8,
                5
            ],
            "neurons": 40,
            "additions": 15360,
            "multiplications": 15360,
            "comparasions": 0,
            "connections": 15360
        },
        {
            "class_name": "Conv1D",
            "name": "conv1d_5",
            "shape": [
                6,
                10
            ],
            "neurons": 60,
            "additions": 900,
            "multiplications": 900,
            "comparasions": 0,
            "connections": 900
        }
    ],
    "neurons": 1380,
    "additions": 16260,
    "multiplications": 16260,
    "comparasions": 0,
    "connections": 16260
}